[
    {
        "deadline": "Cash App, a mobile payment service, and its owner, Block, agreed to pay $15 million to settle a case alleging that the companies failed to protect customer information. If you are a current or former Cash App user whose information was accessed without consent or who experienced fraudulent account withdrawals… Claim deadline is Monday, 18 November 2024.",
        "defendant": "Defendant: Block/Cash App",
        "details": "Defendant: Block/Cash App",
        "title": "Block and Cash App (data breach) »"
    },
    {
        "deadline": "Numi Financial and Central National Bank agreed to a $4 million settlement to resolve allegations that the companies violated the Electronic Fund Transfer Act (EFTA) when they forced individuals who had been arrested to receive their confiscated money, upon release from detention, on a prepaid card issued by the defendants.… Claim deadline is Tuesday, 19 November 2024.",
        "defendant": "Defendant: Numi Financial and Central National Bank",
        "details": "Defendant: Numi Financial and Central National Bank",
        "title": "Numi Financial and Central National Bank (EFTA violations) »"
    },
    {
        "deadline": "Luxury Brand Partners, the company that markets IGK Dry Shampoo products, agreed to pay $850,000 to settle a case alleging that the products contained benzene, a known carcinogen. If you purchased one or more IGK First Class, IGK Direct Flight or IGK Jet Lag spray shampoo products prior to April… Claim deadline is Tuesday, 19 November 2024.",
        "defendant": "Defendant: Luxury Brand Partners",
        "details": "Defendant: Luxury Brand Partners",
        "title": "IGK Dry Shampoo (benzene) »"
    },
    {
        "deadline": "Clif Bar, a manufacturer of energy food and drinks, agreed to pay $12 million to settle allegations that the company made misleading and exaggerated statements about the health properties of its bars, which allegedly are unhealthy due to a high amount of added sugar. If you purchased eligible products between April 19, 2014, and… Claim deadline is Monday, 25 November 2024.",
        "defendant": "Defendant: Clif Bar",
        "details": "Defendant: Clif Bar",
        "title": "Clif Bar (misleading labeling) »"
    },
    {
        "deadline": "Tubi will pay just under $20 million to settle allegations that the video streaming service violated the federal Video Privacy Protection Act (VPPA) when it allegedly disclosed the personally identifiable information of Tubi users for advertising purposes. If you used the Tubi video streaming service between June 23, 2021, and Aug.… Claim deadline is Thursday, 28 November 2024.",
        "defendant": "Defendant: Tubi",
        "details": "Defendant: Tubi",
        "title": "Tubi (VPPA violations) »"
    },
    {
        "deadline": "Pharmaceutical giant Pfizer agreed to pay $35 million to settle allegations that it unlawfully prevented generic versions of Lipitor, a drug prescribed to lower cholesterol, off the market, resulting in buyers paying more for the medication. If you purchased Lipitor in any one of two dozen states or Washington, D.C., without the… Claim deadline is Friday, 29 November 2024.",
        "defendant": "Defendant: Pfizer",
        "details": "Defendant: Pfizer",
        "title": "Pfizer Lipitor (antitrust violations) »"
    },
    {
        "deadline": "Pharmaceutical maker Acella agreed to pay $41.4 million to settle allegations of false advertising related to the company’s NP Thyroid product. The lawsuit alleged that Acella falsely claimed that the thyroid drug contained a specific amount of the active ingredient; some batches of the medication allegedly contained more and others… Claim deadline is Saturday, 30 November 2024.",
        "defendant": "Defendant: Acella Pharmaceuticals",
        "details": "Defendant: Acella Pharmaceuticals",
        "title": "Acella (NP Thyroid false advertising) »"
    },
    {
        "deadline": "Toyota agreed to settle allegations that it equipped certain of its RAV4 SUVs with a defective battery terminal that could result in a loss of power, stalling, and potentially a fire. If you are a current or former owner or lessee of a 2013-2018 RAV4 vehicle that was part of… Claim deadline is Sunday, 01 December 2024.",
        "defendant": "Defendant: Toyota",
        "details": "Defendant: Toyota",
        "title": "Toyota RAV4 (defective batteries) »"
    },
    {
        "deadline": "Earth Rated agreed to pay $825,000 to settle allegations that consumers were misled into believing that Earth Rated Certified Compostable Poop Bags (the “Certified Compostable Poop Bags”) were “compostable.” Consumers who purchased the bags but do not have proof of purchase can receive a $2 payment for each unit purchased, up… Claim deadline is Monday, 09 December 2024.",
        "defendant": "Defendant: Earth Rated",
        "details": "Defendant: Earth Rated",
        "title": "Earth Rated (compostable poop bags) »"
    },
    {
        "deadline": "Citibank agreed to a $29.5 million settlement to resolve claims that the bank’s robocalls to non-customers violated the Telephone Consumer Protection Act (TCPA). If you received one or more calls with an artificial or prerecorded voice from Citibank on your cell telephone between Aug. 15, 2014, and July 31, 2024, concerning… Claim deadline is Friday, 20 December 2024.",
        "defendant": "Defendant: Citibank",
        "details": "Defendant: Citibank",
        "title": "Citibank (TCPA violations) »"
    },
    {
        "deadline": "Starkist and Lion Capital (a former owner of Bumble Bee Foods) will pay $136 million to settle allegations that the companies conspired with other tuna companies to raise and fix the price of canned and pouched tuna. Residents of 30 states, Washington, D.C. and Guam who purchased cans or pouches of tuna smaller… Claim deadline is Tuesday, 31 December 2024.",
        "defendant": "Defendant: Starkist and Lion Capital",
        "details": "Defendant: Starkist and Lion Capital",
        "title": "Starkist and Lion Capital (price fixing) »"
    },
    {
        "deadline": "Patreon, a crowdfunding platform for artists and creators, agreed to pay $7.25 million to resolve allegations that the company disclosed the identities and video-viewing preferences of its users to Facebook without their consent, a violation of the federal Video Privacy Protection Act (VPPA). If, between April 1, 2016, and Sept. 23,… Claim deadline is Wednesday, 01 January 2025.",
        "defendant": "Defendant: Patreon",
        "details": "Defendant: Patreon",
        "title": "Patreon (privacy violations) »"
    },
    {
        "deadline": "A settlement has been reached in a lawsuit brought by the California attorney general against Vitol Inc., SK Energy Americas, Inc., and SK Trading International Co. Ltd. alleging that the defendants manipulated gasoline prices in California, in violation of antitrust laws. Of the $50 million settlement, $37.5 million will go… Claim deadline is Wednesday, 08 January 2025.",
        "defendant": "Defendant: Vitol Inc., SK Energy Americas, Inc., and SK Trading International Co. Ltd. ",
        "details": "Defendant: Vitol Inc., SK Energy Americas, Inc., and SK Trading International Co. Ltd. ",
        "title": "California gasoline (antitrust/price-fixing) »"
    },
    {
        "deadline": "The maker of Hyundai automobiles will pay $145 million to settle allegations that it manufactured certain of its vehicles between 2011 and 2022 without equipping them with an engine immobilizer—a type of electronic security technology—thereby leaving them more vulnerable to theft. If you purchased or leased an eligible Hyundai (listed… Claim deadline is Saturday, 11 January 2025.",
        "defendant": "Defendant: Hyundai",
        "details": "Defendant: Hyundai",
        "title": "Hyundai (vehicle defect) »"
    },
    {
        "deadline": "Visa and Mastercard agreed to pay $197.5 million to settle allegations that the companies violated consumer protection laws by overcharging bank customers when they withdrew money from ATMs using their Visa or Mastercard debit cards. If, between Oct. 1, 2007, and July 26, 2024, you paid unreimbursed surcharges to withdraw cash from… Claim deadline is Wednesday, 22 January 2025.",
        "defendant": "Defendant: Visa and Mastercard",
        "details": "Defendant: Visa and Mastercard",
        "title": "Visa and Mastercard (inflated ATM fees) »"
    }
]